**`teams/delius-iaps/iaps_server`** terragrunt plan on `push` event [#74](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 2s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 3s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_add_manual.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_im_interface.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_sql_developer.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_odbcdns.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_db_client_tools.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_cloudwatch_agent.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.2/1"
        name                  = "delius_iaps_install_base_packages"
      + supported_os_versions = []
        tags                  = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_add_manual-version"                     = "0.1.0"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.0"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.2"
            "delius_iaps_install_im_interface-version"           = "0.1.0"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
            "image-recipe"                                       = "delius_iaps_server/0.0.12"
            "infrastructure-configuration"                       = "delius_iaps_server/0.0.12"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/add-net-framework-features/0.2.0/1"
        name                  = "add_net_framework_features"
      ~ tags                  = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_add_manual.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-add-manual/0.1.0/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: delius_iaps_add_manual
            description: Adds PDF Manual
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 0.1.0
          +       default: 0.1.1
                  description: Component version
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform name
              - S3ArtefactBucket:
                  type: string
                  description: Name of s3 bucket holding software artefacts
            phases:
              - name: build
                steps:
                  - name: DownloadArtefacts
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
          -               Read-S3Object -BucketName {{ S3ArtefactBucket }} -Key "manuals/How-to-import-Database-connections-into-Oracle-SQL-Developer-from-XML.pdf" -File "C:\Users\Public\Desktop\How-to-import-Database-connections-into-Oracle-SQL-Developer-from-XML.pdf"
          +               Read-S3Object -BucketName {{ S3ArtefactBucket }} -Key "delius-iaps/manuals/How-to-import-Database-connections-into-Oracle-SQL-Developer-from-XML.pdf" -File "C:\Users\Public\Desktop\How-to-import-Database-connections-into-Oracle-SQL-Developer-from-XML.pdf"
        EOT
      ~ date_created          = "2023-02-07T09:39:33.427Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-add-manual/0.1.0/1" -> (known after apply)
        name                  = "delius_iaps_add_manual"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "0.1.0" -> "0.1.1" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_cloudwatch_agent.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-cloudwatch-agent/0.1.0/1"
        name                  = "delius_iaps_configure_cloudwatch_agent"
      ~ tags                  = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_odbcdns.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-odbc-dsn/0.1.0/1"
        name                  = "delius_iaps_configure_odbc_dsn"
      ~ tags                  = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.2/1"
        name                  = "delius_iaps_install_base_packages"
      ~ tags                  = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_im_interface.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-im-interface/0.1.0/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: delius_iaps_install_im_interface
            description: Installs delius_iaps_install_im_interface
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 0.1.0
          +       default: 0.1.1
                  description: Component version
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform name
              - S3ArtefactBucket:
                  type: string
                  description: Name of s3 bucket holding software artefacts
            phases:
              - name: build
                steps:
                  - name: DownloadArtefacts
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
          -               Read-S3Object -BucketName {{ S3ArtefactBucket }} -KeyPrefix "apps/im-interface/" -Folder "${env:TEMP}\im-interface"
          +               Read-S3Object -BucketName {{ S3ArtefactBucket }} -KeyPrefix "delius-iaps/apps/im-interface/" -Folder "${env:TEMP}\im-interface"
                  - name: InstallIMInterface
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
                          Start-Process -Wait -FilePath "${env:TEMP}\im-interface\setup.exe" -ArgumentList "/quiet /qn" -Verb RunAs
                          New-Item -ItemType Junction -Path "C:\Program Files\I2N\IapsIMInterface" -Target "C:\Program Files (x86)\I2N\IapsIMInterface"
                  - name: GenerateIMIAPSConfig
                    action: CreateFile
                    inputs:
                      - path: C:\Program Files (x86)\I2N\IapsIMInterface\Config\IMIAPS.xml
                        content: |
                          <?xml version="1.0" encoding="utf-8" standalone="yes"?>
                          <DLLDEF>
                            <IAPSORACLE NAME="IAPSCENTRAL" DESCRIPTION="iaps-db" USER="" PASSWORD="" PROBEDELAYSECS="600" ODBC="DSN=PCMSIFIAPS;uid=%USER%;pwd=%PASSWORD%" TOIAPS="Y" />
                            <SOAPSERVER URL="https://localhost/IMIapsSoap/service.svc" ODBC="DSN=IM;Server=;Database=;uid=;pwd=" />
                          </DLLDEF>
                        overwrite: false
        EOT
      ~ date_created          = "2023-01-20T13:38:09.396Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-im-interface/0.1.0/1" -> (known after apply)
        name                  = "delius_iaps_install_im_interface"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "0.1.0" -> "0.1.1" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_db_client_tools.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-db-client-tools/0.1.0/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: delius_iaps_install_oracle_db_client_tools
            description: Installs delius_iaps_install_oracle_db_client_tools
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 0.1.0
          +       default: 0.1.1
                  description: Component version
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform name
              - S3ArtefactBucket:
                  type: string
                  description: Name of s3 bucket holding software artefacts
            phases:
              - name: build
                steps:
                  - name: GenerateOracleClientRSP
                    action: CreateFile
                    inputs:
                      - path: C:\Windows\Temp\oracle\OracleClient.rsp
                        content: |
                          oracle.install.responseFileVersion=/oracle/install/rspfmt_clientinstall_response_schema_v12.1.0
                          UNIX_GROUP_NAME=
                          SELECTED_LANGUAGES=en,en_GB
                          ORACLE_HOME=C:\app\client\Administrator\product\12.1.0\client_1
                          ORACLE_BASE=C:\app\client\Administrator
                          oracle.install.IsBuiltInAccount=true
                          oracle.install.OracleHomeUserName=
                          oracle.install.OracleHomeUserPassword=
                          oracle.install.client.installType=Administrator
                          oracle.install.client.customComponents=
                          oracle.install.client.schedulerAgentHostName=
                          oracle.install.client.schedulerAgentPortNumber=
                        overwrite: false
                  - name: GenerateSQLNETORATMPL
                    action: CreateFile
                    inputs:
                      - path: C:\Windows\Temp\oracle\sqlnet.ora
                        content: |
                          SQLNET.AUTHENTICATION_SERVICES = (NTS)
                          NAMES.DIRECTORY_PATH= (TNSNAMES, EZCONNECT)
                        overwrite: false
                  - name: GenerateTNSNAMESORATMPL
                    action: CreateFile
                    inputs:
                      - path: C:\Windows\Temp\oracle\tnsnames.ora
                        content: |
                          PCMSSHADOW =
                            (DESCRIPTION =
                              (ADDRESS_LIST =
                                (ADDRESS = (PROTOCOL = TCP)(HOST = iaps-db)(PORT = 1521))
                              )
                              (CONNECT_DATA =
                                (SID = IAPS)
                              )
                            )
            
                          IAPSNR =
                            (DESCRIPTION =
                              (ADDRESS_LIST =
                                (ADDRESS = (PROTOCOL = TCP)(HOST = iaps-db)(PORT = 1521))
                              )
                              (CONNECT_DATA =
                                (SID = IAPS)
                              )
                            )
                        overwrite: false
            
                  - name: DownloadArtefacts
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
          -               Read-S3Object -BucketName {{ S3ArtefactBucket }} -Key "oracle/Oracle_12c_Win32_12.1.0.2.0.7z" -File "${env:TEMP}\oracle\Oracle_12c_Win32_12.1.0.2.0.7z"
          +               Read-S3Object -BucketName {{ S3ArtefactBucket }} -Key "delius-iaps/oracle/Oracle_12c_Win32_12.1.0.2.0.7z" -File "${env:TEMP}\oracle\Oracle_12c_Win32_12.1.0.2.0.7z"
            
                  - name: SetupOracleClient
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          try {
                            & "$env:ProgramFiles\7-Zip\7z.exe" "x" "-y" "-o${env:TEMP}\Oracle\Install" "${env:TEMP}\Oracle\Oracle_12c_Win32_12.1.0.2.0.7z"
                          }
                          catch [Exception] {
                            Write-Host ('Failed to extract Oracle client setup using 7z')
                            echo $_.Exception|format-list -force
                            exit 1
                          }
            
                          try {
                            $oaparamfile = "${env:TEMP}\Oracle\Install\Oracle_12c_Win32_12.1.0.2.0\client32\install\oraparam.ini"
                            if (Test-Path -Path $oaparamfile) {
                              ((Get-Content -path $oaparamfile -Raw) -replace 'MSVCREDIST_LOC=vcredist_x64.exe','MSVCREDIST_LOC=vcredist_x86.exe') | Set-Content -Path $oaparamfile
                            } else {
                              write-host('Error - could not find oracle setup param file: $oaparamfile')
                              exit 1
                            }
                            # Create x86 reg entry
                            Push-Location
                            Set-Location 'HKLM:'
                            New-Item -Path '.\SOFTWARE\Wow6432Node' -Name ORACLE -Type Directory -Force
                            New-Itemproperty -Path .\SOFTWARE\Wow6432Node\ORACLE -Name 'inst_loc' -Value 'C:\Program Files (x86)\Oracle\Inventory' -PropertyType 'String'
                            Pop-Location
                          }
                          catch [Exception] {
                            Write-Host ('Failed creating x86 registry entries')
                            echo $_.Exception|format-list -force
                            exit 1
                          }
            
                          try {
                              $oracleanswerfile = "${env:TEMP}\Oracle\OracleClient.rsp"
                              Start-Process -FilePath "${env:TEMP}\Oracle\Install\Oracle_12c_Win32_12.1.0.2.0\client32\setup.exe" -Verb RunAs -ArgumentList "-silent -nowelcome -nowait -noconfig -responseFile $oracleanswerfile 'ORACLE_HOSTNAME=$env:computername'" -Wait
                              if (!(Test-Path C:\app)) {
                                  Write-Host('Error - Something went wrong installing Oracle client - unable to find install path')
                                  exit 1
                              }
                          }
                          catch [Exception] {
                              Write-Host ('Failed installing Oracle Client')
                              echo $_.Exception|format-list -force
                              exit 1
                          }
            
                          Copy-Item "${env:TEMP}\Oracle\tnsnames.ora" -Destination 'C:\app\client\Administrator\product\12.1.0\client_1\network\admin\tnsnames.ora'
                          Copy-Item "${env:TEMP}\Oracle\sqlnet.ora" -Destination 'C:\app\client\Administrator\product\12.1.0\client_1\network\admin\sqlnet.ora'
            
                          Set-ItemProperty -path "HKLM:\SOFTWARE\Wow6432Node\ORACLE\KEY_OraClient12Home1_32bit" -name "NLS_LANG" -value "ENGLISH_UNITED KINGDOM.WE8MSWIN1252"
        EOT
      ~ date_created          = "2023-01-16T09:57:36.577Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-db-client-tools/0.1.0/1" -> (known after apply)
        name                  = "delius_iaps_install_oracle_db_client_tools"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "0.1.0" -> "0.1.1" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_sql_developer.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-sql-developer/0.1.0/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: delius_iaps_install_oracle_sql_developer
            description: Installs delius_iaps_install_oracle_sql_developer
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 0.1.0
          +       default: 0.1.1
                  description: Component version
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform name
              - S3ArtefactBucket:
                  type: string
                  description: Name of s3 bucket holding software artefacts
            phases:
              - name: build
                steps:
                  - name: DownloadArtefacts
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
          -               Read-S3Object -BucketName {{ S3ArtefactBucket }} -Key "oracle/sqldeveloper-4.1.3.20.78-x64.7z" -File "${env:TEMP}\oracle\sqldeveloper-4.1.3.20.78-x64.7z"
          +               Read-S3Object -BucketName {{ S3ArtefactBucket }} -Key "delius-iaps/oracle/sqldeveloper-4.1.3.20.78-x64.7z" -File "${env:TEMP}\oracle\sqldeveloper-4.1.3.20.78-x64.7z"
            
                  - name: ExtractSQLDeveloper
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
                          & "$env:ProgramFiles\7-Zip\7z.exe" "x" "-y" "-o${env:ProgramData}" "${env:TEMP}\oracle\sqldeveloper-4.1.3.20.78-x64.7z"
            
                          $WshShell = New-Object -ComObject WScript.Shell
                          $Shortcut = $WshShell.CreateShortcut("C:\Users\Public\Desktop\SQLDeveloper.lnk")
                          $Shortcut.TargetPath = "${env:ProgramData}\sqldeveloper-4.1.3.20.78-x64\sqldeveloper\sqldeveloper.exe"
                          $Shortcut.Save()
        EOT
      ~ date_created          = "2023-01-18T09:33:25.370Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-sql-developer/0.1.0/1" -> (known after apply)
        name                  = "delius_iaps_install_oracle_sql_developer"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "0.1.0" -> "0.1.1" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-iaps-server"
        name         = "delius_iaps_server"
      ~ tags         = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-iaps-server" -> (known after apply)
      ~ date_created                     = "2023-02-07T09:51:56.436Z" -> (known after apply)
      ~ date_last_run                    = "2023-02-07T09:52:21.210Z" -> (known after apply)
      ~ date_next_run                    = "2023-03-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-02-07T09:51:56.436Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-iaps-server" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.12" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-12" -> (known after apply)
        name                             = "delius_iaps_server"
      ~ platform                         = "Windows" -> (known after apply)
      ~ tags                             = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.12" -> (known after apply)
      ~ date_created      = "2023-02-07T09:51:54.303Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.12" -> (known after apply)
        name              = "delius_iaps_server"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Windows" -> (known after apply)
      ~ tags              = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      + user_data_base64  = (known after apply)
      ~ version           = "0.0.12" -> "0.0.13" # forces replacement
      - working_directory = "" -> null
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/xvdf" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - snapshot_id           = "snap-04435aa8246764616" -> null
              - throughput            = 0 -> null
              - volume_size           = 7 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/xvdf"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + snapshot_id           = "snap-04435aa8246764616"
              + volume_size           = 7
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-db-client-tools/0.1.0/1" -> (known after apply) # forces replacement

          - parameter { # forces replacement
              - name  = "S3ArtefactBucket" -> null
              - value = "ec2-image-builder-iaps-artefacts" -> null
            }
          + parameter { # forces replacement
              + name  = "S3ArtefactBucket"
              + value = "mod-platform-image-artefact-bucket20230203091453221500000001"
            }
        }
      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-sql-developer/0.1.0/1" -> (known after apply) # forces replacement

          - parameter { # forces replacement
              - name  = "S3ArtefactBucket" -> null
              - value = "ec2-image-builder-iaps-artefacts" -> null
            }
          + parameter { # forces replacement
              + name  = "S3ArtefactBucket"
              + value = "mod-platform-image-artefact-bucket20230203091453221500000001"
            }
        }
      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-im-interface/0.1.0/1" -> (known after apply) # forces replacement

          - parameter { # forces replacement
              - name  = "S3ArtefactBucket" -> null
              - value = "ec2-image-builder-iaps-artefacts" -> null
            }
          + parameter { # forces replacement
              + name  = "S3ArtefactBucket"
              + value = "mod-platform-image-artefact-bucket20230203091453221500000001"
            }
        }
      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-add-manual/0.1.0/1" -> (known after apply) # forces replacement

          - parameter { # forces replacement
              - name  = "S3ArtefactBucket" -> null
              - value = "ec2-image-builder-iaps-artefacts" -> null
            }
          + parameter { # forces replacement
              + name  = "S3ArtefactBucket"
              + value = "mod-platform-image-artefact-bucket20230203091453221500000001"
            }
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }

        # (6 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-12" -> (known after apply)
      ~ date_created                  = "2023-02-07T09:39:33.474Z" -> (known after apply)
      ~ date_updated                  = "2023-02-07T09:51:47.251Z" -> (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-12" -> (known after apply)
      ~ name                          = "delius_iaps_server_0_0_12" -> "delius_iaps_server_0_0_13" # forces replacement
      ~ resource_tags                 = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "delius_iaps_add_manual-version"                     = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_im_interface-version"           = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0" -> "0.1.1"
          ~ "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.12" -> "delius_iaps_server/0.0.13"
            # (15 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 5 to change, 7 to destroy.

```
